Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--t-rex_quickstart.tmx
Source language: en
Languages: ja

source: t-rex Quickstart
ja: t-rexクイックスタート

source: t-rex is a vector tile server specialized on publishing MVT tiles from your own data.
ja: t-rexは、独自のデータからMVTタイルを配信することに特化したベクタータイルサーバです。

source: This Quick Start describes how to:
ja: このクイックスタートでは、次の方法について説明します。

source: generate vector tiles without configuration and inspect them with built-in viewers
ja: 設定なしでベクタータイルを生成し、組み込みビューアで検査する

source: generate a tile cache
ja: タイルキャッシュの生成

source: Start T-Rex
ja: T-Rexを起動

source: Choose :menuselection:`Geospatial --> Web Services --> T-Rex` from the menu.
ja: メニューから:menuselection:`Geospatial-->Web Services-->T-Rex`を選択します。

source: This starts t-rex in zero-config mode connecting to PostGIS database `osm_local`. A browser window is opened showing the t-rex backend.
ja: これにより、PostGISデータベース`osm_local`に接続する設定なしのモードでt-rexが起動されます。ブラウザウィンドウが開き、t-rexのバックエンドが表示されます。

source: Built-in viewers
ja: 組み込みビューア

source: t-rex comes with built-in viewers for inspecting generated vector tiles.
ja: t-rexには、生成されたベクタータイルを検査するためのビューアが組み込まれています。

source: Click on th `X-Ray` entry in the upper right menu to open the x-ray viewer.
ja: 右上のメニューの `X-Ray` をクリックして、x-ray ビューアを開きます。

source: Hover the mouse on a line to inspect the content of a feature.
ja: フィーチャの内容を検査するには、線の上にマウスを置きます。

source: Try also the other viewers.
ja: 他のビューアも試してください。

source: The Mapbox GL viewer and Maputnik require WebGL support, which is probably not available when running OSGeoLive in a VM.
ja: Mapbox GLビューアとMaputnikにはWebGLサポートが必要ですが、VMでOSGeoLiveを実行している場合はおそらく利用できません。

source: Cache seeding
ja: キャッシュシード

source: Close the browser and the terminal window running t-rex.
ja: ブラウザを閉じ、t-rexを実行しているターミナルウィンドウを閉じます。

source: Open any text editor (e.g. :menuselection:`Accessories --> FeatherPad`).
ja: 任意のテキストエディタを開きます(例:menuselection:`Accessories-->FeatherPad`)。

source: Create the file "ne.toml" in your home directory: :file:`/home/user/ne.toml`
ja: ファイル"ne.toml"をホームディレクトリ::file:`/home/user/ne.toml`に作成します。

source: Put the following content in it::
ja: 次の内容を入力します::

source: Open a terminal (:menuselection:`System Tools --> LXTerminal`) and type::
ja: 端末を開き(:menuselection:`System Tools-->LXTerminal`)、次を入力します::

source: To inspect the generated tiles type::
ja: 生成されたタイルを検査するには、次のように入力します::

source: What next?
ja: 次のステップ

source: To create your own map viewer you can use the snippets on the info page in the t-rex backend.
ja: 独自のマップビューアを作成するには、t-rexバックエンドのinfoページにあるスニペットを使用します。

source: After that you can use the built-in Maputnik editor (also linked from the info page) to create your own Mapbox GL Json style.
ja: その後、組み込みのMaputnikエディター(infoページからもリンク)を使って、独自のMapbox GL Jsonスタイルを作成することができます。

source: Website: https://t-rex.tileserver.ch/
ja: ウェブサイト: https://t-rex.tileserver.ch/

source: Support: https://github.com/t-rex-tileserver/t-rex/
ja: サポート: https://github.com/t-rex-tileserver/t-rex/
